<template>
  <v-div>
    <h1>Врачи</h1>
    <v-table :headers="tableHeaders" :content="tableContent" />
  </v-div>
</template>

<script>
import VTable from "@/components/TaBle.vue";
export default {
  components: {
    VTable
  },
  data() {
    return {
      tableHeaders: [
        "ID", "Фамилия", "Имя", "Отчество", "Номер телефона", "Адрес", "Дата рождения"
      ],
      tableContent: [
        [0, 'Иванова', 'Галина', 'Михайловна', '89141468406', 'Ленина, 1', '29.05.1991'],
        [1, 'Петров', 'Константин', 'Андреевич', '89242346789', 'Баргузинская, 6', '13.09.1982'],
        [2, 'Сидорова', 'Наталья', 'Николаевна', '89145205234', 'Солнечная, 6', '22.01.1975'],
        [3, 'Макеев', 'Виктор', 'Сергеевич', '89142367899', 'Молодежная, 3', '12.03.1997'],
        [4, 'Сергеева', 'Маргарита', 'Михайловна', '89123456788', 'Недорезова, 22', '06.08.1984'],
        [5, 'Скворцов', 'Николай', 'Иванович', '89642378908', 'Ленина, 90', '19.04.1973']
      ]
    }
  }
}
</script>

<style>
</style>