<template>
  <v-div>
    <h1>Пациенты</h1>
    <v-table :headers="tableHeaders" :content="tableContent" />
  </v-div>
</template>

<script>
import VTable from "@/components/TaBle.vue";
export default {
  components: {
    VTable
  },
  data() {
    return {
      tableHeaders: [
        "ID", "Фамилия", "Имя", "Отчество", "Дата рождения", "Номер медицинского полиса"
      ],
      tableContent: [
        [1, 'Борисов' , 'Антон', 'Иванович', '23.03.2000','1234678954356789'],
        [2, 'Кузнецова', 'Полина', 'Михайловна', '13.08.1999','2874123695478925'],
        [3, 'Кондрашов', 'Никита', 'Васильевич', '22.09.1982', '14789602578963014'],
        [4, 'Тихомирова', 'Светлана', 'Андреевна', '04.09.2003', '5874036987412305'],
        [5, 'Журавлев', 'Виктор', 'Николаевич', '12.03.2000', '7896214035874123'],
      ]
    }
  }
}
</script>

<style>
</style>